<a href="https://colab.research.google.com/github/2003006/PYTHON-W3IP/blob/main/gloriaW3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Loading my datasets

In [2]:
import pandas as pd
data = '/content/cells_geo.csv'
df= pd.read_csv(r'/content/cells_geo.csv',sep=';')

df.head(2)

   Unnamed: 0  VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17

[2 rows x 12 columns]

In [3]:
data1= '/content/cells_geo_description.xlsx'
df1= pd.read_excel(data1)
df1.head(2)

  Column name        Description  Format
0      VILLES               City  String
1      STATUS  In Service or not  String

In [4]:
data2 = '/content/CDR_description.xlsx'
df2 = pd.read_excel(data2)
df2.head(2)

  Column name    Description   Format
0     PRODUCT   Voice or SMS   String
1       VALUE  Billing price  Integer

In [5]:
data3 = 'MoringaSchool_CB_CDR_20120507.csv'
df3 = pd.read_csv(data3)
df3.head(2)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [7]:
import pandas as pd
data4 = 'MoringaSchool_CB_CDR_20120509.csv'
df4 = pd.read_csv(data4)
df4.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice   61.0  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms    0.0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 10 columns]

In [6]:
data5 = 'MoringaSchool_CB_CDR_20120508.csv'
df5 = pd.read_csv(data5)
df5.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

#Exploration

Listing unique valus for each column in cells_geo.csv dataset

In [ ]:
#unique values in each column of cells_geo.csv dataset
print(df.City.unique())
print(df.Status.unique())
print(df.Locality.unique())
print(df.Geographical_Zone.unique())
print(df.Zone_Name.unique())
print(df.Longitude.unique())
print(df.Latitude.unique())
print(df.Region.unique())
print(df.Area.unique())
print(df.Cell_ID.unique())
print(df.Cell_ID.unique())

['ADJAME' 'ASSINIE' 'KRIKOREA' 'ABOBO' 'BINGERVILLE' 'PLATEAU' 'DALOA'
 'ABENGOUROU' 'ATTECOUBE' 'ABOISSO COMOE' 'ABOISSO' 'BONGOUANOU'
 'ABONGOUA' 'ABOUDEKOUASSIKRO' 'ABRONAMOUE' 'YOPOUGON' 'ADAOU' 'ADDAH'
 'ADEBEM' 'ADIAKE' 'ADJAMENE' 'PORT-BOUET' 'ADZOPE' 'AFFERY' 'COCODY'
 'AGBOVILLE' 'AGNIBILEKRO' 'AGONDA' 'AGOU' 'MARCORY' 'AHIZABRO' 'AHOUANOU'
 'BOUAKE' 'AKOBOISSUE' 'AKOUPE' 'AKOUYAKRO' 'AKRADJO' 'KOUMASSI' 'ALEPE'
 'ALERIA' 'BAMORO' 'ALLOKOI' 'ANANDA' 'ANDO' 'ANDOKOKRENOU' 'ANIANSUE'
 'ANOUMABA' 'ANYAMA' 'AOUNIANFOUTOU' 'APPOISSO' 'ARRAH' 'ASSIKOI'
 'ASSUEFRY' 'ATTIGUEHI' 'ATTINGUIE' 'ATTROBROU' 'AYAME' 'AYAPRIKRO'
 'AZAGUIE' 'BACANDA' 'BADIKAHA' 'BAGOHOUO' 'BAHOMPA' 'BACOUBLY' 'BALEKO'
 'SAN-PEDRO' 'BANADJE' 'BANANKORO' 'BANDAKANY' 'BANDIAHI' 'BANGOLO'
 'BANIA' 'BANTEAPLEU' 'BAOUBLI' 'YAMOUSSOUKRO' 'GRAND-BASSAM' 'BAYOTA'
 'BAZRA NATTIS' 'BECEDIBRIGNAN' 'BEDIALA' 'BEKOUEFIN' 'BENGASSOU' 'BEOUE'
 'BEOUMI' 'BETTIE' 'BIANKOUMA' 'BIANOUAN' 'BIELOU-CARREFOUR' 'BILIMONO'
 'BINAO' 'BIN HOUNIEN' 'BLAHOU' 'BLANFLA' 'DIANOUFLA' 'BLE' 'BLESSEGUE'
 'BLOLEQUIN' 'BOCANDA' 'BODO' 'BODOKRO' 'BOGUEDIA' 'BOLI' 'BONAHOUIN'
 'BONDOUKOU' 'BONGO' 'BONGUERA' 'BONIEREDOUGOU' 'BONIKRO' 'BONON' 'BONOUA'
 'BONOUFLA' 'BOOKO' 'BORON' 'BOROTOU' 'BOROTOUKRO' 'BOTRO' 'BOUADIKRO'
 'BOUAFLE' 'BOUADOUGOU' 'BOUAPE' 'BOUGOU' 'BOUNA' 'BOUNAFLA' 'BOUNDIALI'
 'BOZI' 'BROBO' 'BROFFOUEDOU' 'BROFODOUME' 'BROU AKPASSOU' 'BUYO' 'CECHI'
 'CHIEPO' 'TREICHVILLE' 'COLLINEKASSEREGUE' 'KETEKRE' 'DABADOUGOU'
 'DABAKALA' 'DABOU' 'DABOUYO' 'DAGADJI' 'DAGOUAHIO' 'DAHIRI'
 'DAIRO/DIDIZO' 'DAKPADOU' 'DAME' 'DANANE' 'DANANON' 'DANGUIRA' 'DANIA'
 'DAOUKRO' 'DASSIOKO' 'DIABO' 'DIAMARAKRO' 'DIANGOKRO' 'DIANRA'
 'DIANRAVILLAGE' 'DIARABANA' 'DIARAKRO' 'DIAWALA' 'DIDIEVI' 'DIDOKO'
 'DIEGONEFLA' 'DIEOUZON' 'DIGNAGO' 'DIKODOUGOU' 'DIMBOKRO'
 'DIOULATIEDOUGOU' 'DIVO' 'DIVO PALMCI' 'DJASSANOU' 'DJEBONOUA'
 'DJEMISSIKRO' 'DJENIDOUFLA' 'DJIBROSSO' 'DJI' 'DJOUKOUYO' 'DOKE' 'DOROPO'
 'DOTENZIA' 'DOUFREBO' 'DOUGOUDOU SODEMI' 'DOUGROUPALEGNOA' 'DUEKOUE'
 'EBIKRO' 'EHANIA' 'ELLIBOU' 'HIRE' 'ETTROKRO' 'ETUEBOUE' 'FACOBLY'
 'FADYADOUGOU' 'FEREDOUGOU' 'FERKE' 'FLAKIE' 'FOUMBOLO' 'FOUNGBESSO'
 'FRESCO' 'FRONAN' 'GABIADJI' 'GADOUAN' 'GAGNOA' 'GAZIBOUO' 'GBAGBAM'
 'GBAPLEU' 'GRAND BEREBY' 'GBELEBAN' 'GBETEGUELA' 'GBONNE' 'GRAND LAHOU'
 'GLIGBEUADJI' 'GNABOYA' 'GNAGBODOUGNOA' 'GNAMONO' 'GNIPI' 'GOHITAFLA'
 'GOMENEBERI' 'GONATE' 'GOULIA' 'GRAND-ZATRY' 'GROBIASSOUME' 'GUEHIEBLY'
 'GUESSABO' 'GUESSIGUIE' 'GUEYO' 'GUEZON' 'GUEZON TAHOUAKE' 'GUIBEROUA'
 'GUIEMBE' 'GUIGLO' 'GUINKIN' 'GUINTEGUELA' 'GUITRY' 'HEREMANKONO'
 'HERMANKONONO/DIES' 'IBOGUHE' 'IDEFOR' 'ILESBOULEY' 'IROBO' 'ISSIA'
 'ITTY' 'JACQUEVILLE' 'KAHANSO' 'KAKOHORO' 'KALAKALA' 'KAMELE' 'KAMORO'
 'KANAKONO' 'KANI' 'KANOROBA' 'KANZRA' 'KASSERE' 'KATIOLA' 'KEIBLA'
 'KETESSO' 'KETRO BASSAM' 'KIMBIRILA NORD' 'KIMBIRILA SUD' 'KLOTOU'
 'KOBEDAIGOURE' 'KODIOSSOU' 'KODJINAN' 'KOFFI AMONKRO' 'KOKOUMBO' 'KOLIA'
 'KOMBORODOUGOU' 'KONAHIRI' 'KONEDOUGOU' 'KONG' 'KONGASSO' 'KONI'
 'KONONFLA' 'KONTROU' 'KOONAN' 'KOREA' 'KORHOGO' 'KORO' 'KOSSANDJI'
 'KOSSOU' 'KOTABLEA' 'KOTOUBA' 'KOTOULA' 'KOUASSIDATEKRO'
 'KOUASSIKOUASSIKRO' 'KOUEGO' 'KOUIBLY' 'KOUN-FAO' 'KOUNTIGUISSO' 'KOUTO'
 'KOYOKRO' 'KPAPEKOU' 'KPOUEBO' 'KRINJABO' 'KRIZABAHIO' 'LAFOKPOKAHA'
 'DEDI' 'LAHOUDIBA' 'LAKOTA' 'LAMADOUGOU' 'LAOGUIE' 'LARABIA' 'LATAHA'
 'LUEHOUAN' 'LOGBOVILLE' 'LOGOUALE' 'LOUGBONON' 'LOVIGUE' 'LUENOUFLA'
 'MADINANI' 'MAFERE' 'MAHAPLEU' 'MAMA' 'MAN' 'MANKONO' 'MANZANOUAN'
 'MARABADIASSA' 'MARANDALA' 'MASSALA' 'MAYO' "M'BAHIAKRO" 'MBATTO'
 'MBENGUE' 'MBONOUA' 'MBORLA' 'MBROU' 'MEADJI' 'MEMNI' 'MINIGNAN' 'MINORE'
 'MOAPE' 'MONTCOUPE' 'MORONDO' 'MORONOU' 'MOUSSADOUGOU' 'NAFALA' 'NAMASSI'
 'NAMBENGUE' 'KARAKORO' 'NANIEFONGO' 'NAPIE' 'NASSIAN' 'KOUASSIA-NIAGUNI'
 "N'DEBO" "N'DOUCI" 'NDOUKAHAKRO' 'NEKA' 'NGATTADOLIKRO' "N'GATTAKRO"
 'NGUINOU' 'NIABABLY' 'NIABLE' 'NIAKARA' 'TOUIH' 'NIAMANA' 'NIAMBEZARIA'
 'NIANDA' 'NIANGBO' 'NIDROU' 'NIOFOIN' 'NOE' 'NOUAMOU' 'NOUKPOUDOU'
 'NOUVELLEOUSROU' "N'ZECREZESSOU" 'NZIANOUA' "N'ZIKRO" 'ODIENNE' 'OGHLAPO'
 'OKROUYO' 'ORESS KROBOU' 'OTTAWA' 'OUALEBO' 'OUANGOLO' 'OUANINOU'
 'OUATTARADOUGOU' 'OUELLE' 'OUME' 'OUNADIEKAHA' 'OUPOYO' 'OURAGAHIO'
 'PAKAOUBO' 'BLIDOUBA' 'IBOKE' 'PARA' 'PEHE' 'PELEZI' 'PETIONARA'
 'PETIT YAPO' 'PINHOU' 'PINHOU KOULOUAN' 'PODIAGOUINE' 'POGO'
 'PONANGUIGLO' 'PRIKRO' 'POPREAGUI' 'SIPILOU' 'RAPIDES GRAH' 'RAVIART'
 'RUBINO' 'SAFCO' 'SAGO' 'SAHUE' 'SAIOUA' 'SAKAHOUO' 'SAKASSOU' 'SAMANGO'
 'SAMATIGUILA' 'SAMO' 'SANANFEREDOUGOU' 'SANDEGUE' 'SANGOUINE'
 'SANKADIOKRO' 'SAPLI' 'SARAKADJI' 'SARHALA' 'SASSANDRA' 'SATIKRAN'
 'SEGUELA' 'SEGUELON' 'SEMIEN' 'SERHIO' 'SEYDOUGOU' 'GOUMERE' 'SIANA'
 'SIEMPURGO' 'SIENSOBA' 'SIFIE' 'SIKENSI' 'SINEMATIALI' 'SINFRA'
 'SINGROBO' 'SIRASSO' 'MOUSSAYO' 'SOKORODOUGOU' 'SOMINANSE' 'SONDO'
 'SONGON' 'SONGON DAGBE' 'SONONZO' 'SOROBANGO' 'SOUBRE' 'BALEYO'
 'ZUENOULA' 'TAABO' 'TABAGNE' 'TABOU' 'TAFIRE' 'TAHIRAGUHE' 'TAHOGORA'
 'TAI' 'TALA' 'TANDI' 'TANDA' 'TANGUELAN' 'TANKESSE' 'TAOUDI'
 'TINDENE BAMBARASSO' 'TENGRELA' 'TIAPOUM' 'TIASSALE' 'TIEBISSOU' 'TIEMA'
 'TIEMELEKRO' 'TIEME' 'TIENDEKRO' 'TIENKO' 'TIMBE' 'TIOBLY' 'TOROGUHE'
 'TORO-KINKENE' 'TORTYA' 'TOUBA' 'TOUKOUZOU' 'TOULEUPLEU' 'TOUMODI'
 'DJEKANOU' 'TOUMODISAKASSOU' 'TOUPAH' 'TOUVRE' 'TRANSUA' 'VAVOUA'
 'VROUHO' 'WENDENE' 'WOROFLA' 'YABAYO' 'YAKASSE-ATTOBROU' 'YAKASSEFEYASSE'
 'YAKASSEME' 'YAOKRO' 'YAOSEDOUGOU' 'YAOU' 'YOROBODI' 'YOUWASSO' 'ZAALA'
 'ZADDI' 'ZAGNE' 'ZAIBO' 'ZALIOHOUAN' 'ZAMBAKRO' 'ZARANOU' 'ZAROKO'
 'ZATTA' 'ZIKISSO' 'ZON-HOUNIEN' 'ZOUKOUGBEU']
['In Service' nan]
['ABIDJAN' 'INTERIEUR']
['"Abidjan_EST' 'Grand-EST' 'Grand-OUEST' '"Abidjan_NORD'
 '"Abidjan_CENTRE' 'Abidjan_NORD' 'Abidjan_EST' 'Abidjan_OUEST'
 'Grand-SUD' 'SUD-OUEST' 'Abidjan_CENTRE' 'Abidjan_SUD' 'Grand-NORD'
 'Gd-ABIDJAN' '0']
['AGBANNEW' 'ASSINIE"' 'KRIKOREA"' 'NPONON' 'OKAHOTEL' 'PALMABINGERVILLE'
 'TIAMA' 'WILLIAMSVILLE2' 'ZONE E - Abidjan_NORD' 'ZONE B - Abidjan_EST'
 'ZONE D - Grand-OUEST' 'ZONE C - Grand-EST' 'ZONE C - Abidjan_OUEST'
 'ZONE B - Grand-SUD' 'ZONE E - SUD-OUEST' 'ZONE A - Abidjan_CENTRE'
 'ZONE B - Abidjan_OUEST' 'ZONE B - Abidjan_CENTRE' 'ZONE D - Abidjan_SUD'
 'ZONE B - Grand-EST' 'ZONE A - Grand-NORD' 'ZONE D - Grand-SUD'
 'ZONE D - Abidjan_EST' 'ZONE C - Grand-SUD' 'ZONE C - Abidjan_SUD'
 'ZONE A - Grand-SUD' 'ZONE C - Abidjan_EST' 'ZONE B - Abidjan_Nord' nan
 'ZONE A - Grand-EST' 'ZONE B - Abidjan-EST' 'ZONE A - Abidjan_OUEST'
 'ZONE B - Abidjan_SUD' 'ZONE B - Grand-NORD']
[-4.00066667 -3.48846667 -6.62705556 ... -4.01794444 -6.03969444
 -6.06545   ]
[5.36819444 5.15876111 6.70736111 ... 5.26519444 7.42861111 7.44459167]
['LAGUNE' 'SUD COMOE' 'HAUT SASSANDRA' 'MOYEN COMOE' 'AGNEBY'
 'SUD BANDAMA' 'BAS SASSANDRA' 'LACS' 'FROMAGER' 'VALLEE DU BANDAMA'
 'NZI COMOE' 'ZANZAN' 'MOYEN CAVALLY' 'WORODOUGOU' 'DENGUELE'
 '18 MONTAGNES' 'SAVANE' 'MARAHOUE' 'BAFING']
[nan 'ABIDJAN NORTH' 'NORTH WEST' 'EAST' 'ABIDJAN SOUTH' 'SOUTH WEST'
 'CENTRE NORTH']
['1502501d78' '0c2e182a0c' '69bdfc69fd' ... 'cb71f8a29c' 'd4a6a0b645'
 'f9f3e42589']
['1502501d78' '0c2e182a0c' '69bdfc69fd' ... 'cb71f8a29c' 'd4a6a0b645'
 'f9f3e42589']

Unique values in Cells _geo_ description.

In [ ]:

print(df1.Description.unique())
print(df1.Format.unique())

['City' 'In Service or not' 'in ABIDJAN or not' 'Geographical Zone'
 'Name of Zone' 'Longitude' 'Latitude' 'Region' 'Area' 'ID of the cell'
 'Site (there are several cells per site, several sites per City, several Cities per Zone, etc.)']
['String' 'Float']

Unique values in CDR description.xlsx dataset

In [ ]:
#unique values to each column of CDR description.xlsx dataset

print(df2.Description.unique())
print(df2.Format.unique())

['Voice or SMS' 'Billing price' 'Time in format yyyy-MM-dd hh:mm:ss.0'
 'Which cell in the site was used (not needed here)'
 'Anonymized phone number of the person for which the CELL_ID and SITE_ID are given'
 'Anonymized phone number of the counterparty'
 'Country of party A (useless here)' 'Country of party B (useless here)'
 'ID of the cell' 'ID of the SITE']
['String' 'Integer']

Unique values in MoringaSchool_CB_CDR_20120507.csv dataset

In [ ]:
#Unique values in each column of the dataset
print(df3.PRODUTC.unique())
print(df3.VALUE.unique())
print(df3.DATETIME.unique())
print(df3.CELL_ON_SITE.unique())
print(df3.DW_A_NUMBER_INT.unique())
print(df3.DW_B_NUMBER_INT.unique())
print(df3.COUNTRY_A.unique())
print(df3.COUNTRY_B.unique())
print(df3.CELL_ID.unique())
print(df3.SITE_ID.unique())

['Voice' 'sms' 'data']
[    0    25    56    14    44    50    19   192    99    12    24  1610
   152   138    30     1     2    17    22    20    21    27    16    35
   201    74    31     3    38     7   286    70    13    39    11    53
    61    28    49    90     9    47    40   300    55   185   113   120
    64     4   128    34    46     8    42    54    60    76    18    43
    66   100    83    10    57   205    32    72   447   318    96    45
    51    15    62     5   279   107   133    92   237   500   200   450
    29    33   109   130   210    78   766    84   388   154    26    80
    48   220  1036  1118   110    97    36   105     6   976    58   111
    23   174    77    52   150    59   102    63   225    69   196   108
    89   214   136   179    88  1072   118   194   402   161   298    95
  4440    73   190   215   132   143   400   886   291   254   151    41
   162   189   239    37   106   638   119   180    75   232   250   104
    68    91   362   167    81   258   112   137   343   252   284    98
   146   280   126   135   270    82   124   188   114   476   256    93
   158   169   272    86   328   191   434   381    79   140   390   324
   170   474   122   131   212   176   580   364   281   293   144   614
   230   172   134   240   142   467   198   898   218   186    94    65
    71  1162   181   330   171   160   601   224    87   277   404   490
   222   183   320   236   159   357   163   962   360   123   262   115
  1860   414   800   178   125   420   321   193   223   156   555   342
   399   594   980   199   166   290   255   153   203   266   294   155
  4886   748   376   356   168   271   482    67   103   139   314   249
    85   184   470   501   229   540   436   245   173  1326   329   195
   117   382   538   373   296   494   600   533   164   260   576   560
   157  1328   101   206   316   175   484  2282   207   498   530   375
   295   264   202   187   276  1000   811   720   141   325   147   127
   520   438   596  1020   148   430   344   285   288   340   758   197
  3000   208  1052   666   495   204   570  1068   395  1050   116   275
   306   458   228   259   273   261  1064   149   674   304   219   238
  1348   542  1058   975   274   619   776   852   243   519   235   221
   918   244  1330   383  1946   242   129  1132  1155   182  1800   610
   211   535  1360   322   371   460  2496  1830   462   282   347   428
   471   217   665  1026   334   444   246   965   292   305   303  1410
   354  1180   310   998  2000   417   418   604   586  1235   459  3324
   177   516   455   412   251   775   504   248   425   492  1741   268
   308   213   312   351   550   463   231   145  1120   226   368   563
   335   253   853   216  1001   531   121  1677  2084   349   234   499
   468   534   385   209   451   900   480   326  2653   165   384   257
   297   558   421   472   523   233  2383   514   313   512   366   515
   372   888   426   568   378   380   479  1630   716   502   377   780
   655  4020  2316   506   578   346  2014   760   341   410  1307   507
   247   521   464   634   768   588   670  3762   946  1100   510  2012
   440   283  2963   640   522  1999   795   956  8385   698   416   718
   307   446   374   392   265   536  2100   408   338  1061   394   732
   359   398   336   880   690   884   448   562   661   920   579   699
  1110   301   358   882   311   339   620   541   497   826   432   680
  1290   337   985   872   793   532   894   345  3245   424   407   348
  1080   960  1974   876   309   269   812   598   657  1380  2029   332
  3164  1060  5194   350   984   994   763   909  1274   810   505   672
  1520   379   590   429   302  1428   592   227   442   263  1201  2630
   415   278   363  1898   475   405   544   942  2400   742   764   539
   422   902   778   315   930   814   797   485  2220   367   466   370
  1236   396   389  1300   561   423  1760  1014   571  2377   839  1350
  1496   654   386  1640   831   443   524  1320   478   792  1200  1002
  1202   621   954  4993   564   327   355   903  4249   948   441   323
   737  1375  1607   548   936   454  1534   518   401  2114   477  1714
   397  1544  2265   979   551   828   361   660   333   456   525  3162
   706  1476  2210  1758  1010  5603   752   682  5802  1108   289  6182
   553  3395  1056   496  1636   406  2142   681   668   991   403   452
  1208  1381   827   559   517   662 14193  1213   694   486   287  1266
  9463  1258   267   686   457   834  3520   582  1130  1025  1078   786
   488   881  1302  2070  7190   934  1392   353  2300  1254  2945   678
   526   996   585  3240   369   622  2724  3077   647  1497   635  1076
  3254  1398  1400   439  1596  1284  2706   870   352   331   726  3098
   431   740  3138  1286  1658  2120  2520   713  1116  1170   393   602
  2480   584  5036]
['2012-05-06 23:04:37.0' '2012-05-06 23:05:25.0' '2012-05-06 23:05:41.0'
 ... '2012-05-07 02:50:10.0' '2012-05-07 02:50:11.0'
 '2012-05-07 02:50:12.0']
['1' '0' '_' '5' '2' '3' '4' '6' '9' '7']
['49fae048b547780' '7a54a6eaee19e65' '6008887b0207d82' ...
 '4f17edb136d4da8' 'a83cab543abe924' 'd5086a1f26ded39']
['1a49f8b0ded9de6' '93343ba6e41af95' '7aacc9709ce0a20' ...
 'd1c99f21cabd3f5' 'df9e6c33d2adf13' 'f720ed91d06ce55']
['19e2e' 'OTHER']
['19e2e' 'OTHER']
['/TJNe+Mmtu' '/+cKZKIp41' '/u0FSD+ahi' ... 'SU0HmXdjIL' '06ea9799d9'
 'mSuZBJ8qeP']
['/TJNe+Mmtu' '/+cKZKIp41' '/u0FSD+ahi' ... '88d04c4407' 'mSuZBJ8qeP' 'b']

#Unique values in MoringaSchool_CB_CDR_20120509.csv dataset

In [ ]:
#Unique values in each column of the datset
print(df4.PRODUCT.unique())
print(df4.VALUE.unique())
print(df4.DATE_TIME.unique())
print(df4.CELL_ON_SITE.unique())
print(df4.DW_A_NUMBER_INT.unique())
print(df4.DW_B_NUMBER_INT.unique())
print(df4.COUNTRY_A.unique())
print(df4.COUNTRY_B.unique())
print(df4.CELLID.unique())
print(df4.SIET_ID.unique())

['Voice' 'sms' 'data']
[  61    0   10 ... 1386 4031 7740]
['2012-05-08 23:01:28.0' '2012-05-08 23:01:31.0' '2012-05-08 23:02:59.0'
 ... '2012-05-09 10:26:24.0' '2012-05-09 10:26:25.0'
 '2012-05-09 10:26:26.0']
['2' '1' '0' '4' '_' '5' '3' '6' '7' '8' 'E' 'F' 'A' 'B' '9' 'C' 'D' nan]
['966f68353622feb' 'a0a597384c612d7' '5441a9a58c97132' ...
 '8a69d22d93aaa71' '707dee2533ea7ac' nan]
['ffd53a3bb2db6f1' 'cf3b218f1dde792' '52f8b299515b9b7' ...
 '7aa17381db751eb' '5de55b17357efab' nan]
['19e2e' 'OTHER' nan]
['19e2e' 'OTHER' nan]
['+38u2u/rfx' '+Fs4mTvdKx' '+ZaaZozy/+' ... '969e9d2fe5' '9895acefb8' nan]
['+38u2u/rfx' '+Fs4mTvdKx' '+ZaaZozy/+' ... 'f615333505' '9e8c39b126'
 '9094b809cd']

# Unique vales of MoringaSchool_CB_CDR_20120508.csv dataset

In [ ]:
#Unique values in each column of the dataset
print(df5.PRODUCT.unique())
print(df5.VALUE.unique())
print(df5.DATE_TIME.unique())
print(df5.CELL_ON_SITE.unique())
print(df5.DW_A_NUMBER.unique())
print(df5.DW_B_NUMBER.unique())
print(df5.COUNTRY_A.unique())
print(df5.COUNTRY_B.unique())
print(df5.CELL_ID.unique())
print(df5.SITE_ID.unique())

['sms' 'Voice' 'data']
[   0   37   25 ... 2158 1310 1074]
['2012-05-07 23:02:06.0' '2012-05-07 23:03:44.0' '2012-05-07 23:04:06.0'
 ... '2012-05-08 09:23:42.0' '2012-05-08 09:23:43.0'
 '2012-05-08 09:23:44.0']
['2' '1' '0' '4' '_' '3' '5' '8' '7' '6' '9' 'E' 'F' 'B' 'C' 'D' 'A']
['32255675c3b6fe3' 'ff16d6ac74c1c64' '98d9f2fb5ff624b' ...
 '153afde6fbd9787' '0a9d25bb039ed0c' '5963a69c67097e1']
['1aa7ae01386e9fb' '87d87309c15a8c9' '93343ba6e41af95' ...
 'c88ec7436996936' '3ba6b7185cea347' '85b58b1cd202fe1']
['19e2e' 'OTHER']
['19e2e' 'OTHER' '1']
['+854AcBQT2' '+laSrk7g6q' '/xvRrCVKoQ' ... 'aa06fa3b0b' '4980f58c73' nan]
['+854AcBQT2' '+laSrk7g6q' '/xvRrCVKoQ' ... 'f31a281724' 'bee9acb51b'
 '45fe28a4c9']

# Data Cleaning

Correcting column names in my 'MoringaSchool_CB_CDR_20120507.csv'

In [8]:
import pandas as pd
data3 = '/content/MoringaSchool_CB_CDR_20120507.csv'
df3= pd.read_csv(data3,header =0, names = ['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER_INT','DW_B_NUMBER_INT','COUNTRTY_A','COUNTRY_B','CELL_ID','SITE_ID'])
df3.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

Correcting column names in 'MoringaSchool_CB_CDR_20120509.csv' dataset

In [9]:
data4 = '/content/MoringaSchool_CB_CDR_20120509.csv'
df4= pd.read_csv(data4,header =0, names = ['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER_INT','DW_B_NUMBER_INT','COUNTRTY_A','COUNTRY_B','CELL_ID','SITE_ID'])
df4.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 10 columns]

Correcting columns in my MoringaSchool_CB_CDR_20120508.csv

In [10]:
data5 = '/content/MoringaSchool_CB_CDR_20120508.csv'
df5= pd.read_csv(data5,header =0, names = ['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER_INT','DW_B_NUMBER_INT','COUNTRTY_A','COUNTRY_B','CELL_ID','SITE_ID'])
df5.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

In [11]:
df1_all = pd.concat((df3,df4,df5), axis=0)
df1_all.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

Dropping unwanted columns in my dataset

In [12]:
df1_all.drop(['COUNTRTY_A','COUNTRY_B'], axis=1,inplace=True)

In [13]:
# change the column names to lower case
df1_all.columns = map(str.lower, df1_all.columns)
df1_all.head(2)

  product  value  ...     cell_id     site_id
0   Voice    0.0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  ...  /+cKZKIp41  /+cKZKIp41

[2 rows x 8 columns]

In [ ]:
#check for duplicates in df1_all
df1_all.duplicated().sum()

In [14]:
df1_all.drop_duplicates()

       product  value  ...     cell_id     site_id
0        Voice    0.0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1          sms    0.0  ...  /+cKZKIp41  /+cKZKIp41
2          sms   25.0  ...  /u0FSD+ahi  /u0FSD+ahi
3        Voice   56.0  ...  +cNeJzsTp3  +cNeJzsTp3
4        Voice   14.0  ...  051KhYDCpv  051KhYDCpv
...        ...    ...  ...         ...         ...
240201     sms   50.0  ...  17ba194a62  6049499424
240202     sms    0.0  ...  923c4e27ac  13c690c436
240203     sms    0.0  ...  03ee801971  7f76d66503
240204     sms    0.0  ...  c8ac59a7e2  012114d799
240205     sms    0.0  ...         NaN         NaN

[642790 rows x 8 columns]

Cleaning cells_geo.csv

In [15]:
#changing columns to lower case which will help in merging with df_all
df.columns = map(str.lower, df.columns)
df.head(2)

   unnamed: 0  villes      status  ... area     cell_id   site_code
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17

[2 rows x 12 columns]

In [ ]:
#check for duplicates
df.duplicated().sum()

0

In [16]:
#drop duplicates
df.drop_duplicates()

      unnamed: 0    villes      status  ...          area     cell_id   site_code
0              0    ADJAME  In Service  ...           NaN  fbb2e75af3  0bb492ef17
1              1    ADJAME  In Service  ...           NaN  1502501d78  0bb492ef17
2              2    ADJAME  In Service  ...           NaN  0c2e182a0c  0bb492ef17
3              3   ASSINIE  In Service  ...           NaN  69bdfc69fd  8a1e6ce31f
4              4   ASSINIE  In Service  ...           NaN  7a1029d2ab  8a1e6ce31f
...          ...       ...         ...  ...           ...         ...         ...
3969        3969  ZUENOULA  In Service  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970        3970  ZUENOULA  In Service  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971        3971  ZUENOULA  In Service  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972        3972  ZUENOULA  In Service  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973        3973  ZUENOULA  In Service  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 12 columns]

#Merged datasets

In [17]:
#merging df1_all and df
df2_all=pd.merge(df,df1_all, how='inner', left_on=['site_code'],right_on=['site_id'])
df2_all.head(2)

   unnamed: 0  villes      status  ...  dw_b_number_int   cell_id_y     site_id
0           0  ADJAME  In Service  ...  4bd696f83bb5a7a  ac8f1ccb39  0bb492ef17
1           0  ADJAME  In Service  ...  c5e2a767aabe0ac  16679571be  0bb492ef17

[2 rows x 20 columns]

Merging cell_geo_descrption.csv and CDR_descricption xlsx

In [ ]:
df_all= pd.concat((df1 ,df2), axis=0)
df_all

        Column name                                        Description   Format
0            VILLES                                               City   String
1            STATUS                                  In Service or not   String
2      LOCALISATION                                  in ABIDJAN or not   String
3        DECOUPZONE                                  Geographical Zone   String
4          ZONENAME                                       Name of Zone   String
5         LONGITUDE                                          Longitude    Float
6          LATITUDE                                           Latitude    Float
7            REGION                                             Region   String
8              AREA                                               Area   String
9           CELL_ID                                     ID of the cell   String
10        SITE_CODE  Site (there are several cells per site, severa...   String
0           PRODUCT                                       Voice or SMS   String
1             VALUE                                      Billing price  Integer
2         DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3      CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4   DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5   DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6         COUNTRY_A                  Country of party A (useless here)   String
7         COUNTRY_B                  Country of party B (useless here)   String
8           CELL_ID                                     ID of the cell   String
9           SITE_ID                                     ID of the SITE   String

# Data Analysis

In [23]:
#which one were the most used cities for the three days
df2_all.groupby('villes')['value'].sum().sort_values(ascending=False).head(5)

villes
COCODY         5183034.0
YOPOUGON       4853168.0
ABOBO          3047963.0
MARCORY        2480697.0
TREICHVILLE    2098676.0
Name: value, dtype: float64

In [24]:
#most used city for for the 3 three days
df2_all.groupby('villes')['value'].sum().sort_values(ascending=False).head(1)

villes
COCODY    5183034.0
Name: value, dtype: float64

In [28]:
#Which ones were the most used products for the three days
import numpy as np
df2_all.groupby('product')['product'].count()

product
Voice     987155
sms      1554780
Name: product, dtype: int64

In [33]:
#sites which were most used
df2_all['site_id'].value_counts().sort_values(ascending=False).head(5)

b47a998a3e    73602
928a59b635    45477
7f76d66503    35538
5c565fbfb1    26514
bc58a52936    25362
Name: site_id, dtype: int64

In [34]:
#descriptive analysis for df2_all
df2_all.describe()

         unnamed: 0     longitude      latitude         value
count  2.541935e+06  2.541935e+06  2.541935e+06  2.541935e+06
mean   2.004078e+03 -4.637755e+00  5.897262e+00  1.562228e+01
std    1.234859e+03  1.057480e+00  1.003965e+00  8.573648e+01
min    0.000000e+00 -8.503889e+00  0.000000e+00  0.000000e+00
25%    9.660000e+02 -5.260333e+00  5.335306e+00  0.000000e+00
50%    2.075000e+03 -4.063111e+00  5.389417e+00  0.000000e+00
75%    3.108000e+03 -4.005583e+00  6.144944e+00  2.000000e+00
max    3.973000e+03 -0.000000e+00  1.044132e+01  1.419300e+04

In [35]:
#information about df2_all dataset
df2_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2541935 entries, 0 to 2541934
Data columns (total 20 columns):
 #   Column           Dtype
---  ------           -----
 0   unnamed: 0       int64
 1   villes           object
 2   status           object
 3   localisation     object
 4   decoupzone       object
 5   zonename         object
 6   longitude        float64
 7   latitude         float64
 8   region           object
 9   area             object
 10  cell_id_x        object
 11  site_code        object
 12  product          object
 13  value            float64
 14  date_time        object
 15  cell_on_site     object
 16  dw_a_number_int  object
 17  dw_b_number_int  object
 18  cell_id_y        object
 19  site_id          object
dtypes: float64(3), int64(1), object(16)
memory usage: 407.3+ MB